[
  {
    "id": "A word from our sponsors: Revolut Your Online Account In Minutes — Spend abroad with a Revolut card ",
    "text": "A word from our sponsors: Revolut Your Online Account In Minutes — Spend abroad with a Revolut card & exchange currency in no time. Download the app today!  Control your money now and save for the future with smart budgeting and analytics tools.\nMore info >",
    "date": "2025-09-12T23:36:47.000Z"
  },
  {
    "id": "The Great, and even Legendary, Charlie Kirk, is dead. No one understood or had the Heart of the Yout",
    "text": "The Great, and even Legendary, Charlie Kirk, is dead. No one understood or had the Heart of the Youth in the United States of America better than Charlie. He was loved and admired by ALL, especially me, and now, he is no longer with us. Melania and my Sympathies go out to his",
    "date": "2025-09-10T20:41:33.000Z"
  },
  {
    "id": "In honor of Charlie Kirk, a truly Great American Patriot, I am ordering all American Flags throughou",
    "text": "In honor of Charlie Kirk, a truly Great American Patriot, I am ordering all American Flags throughout the United States lowered to Half Mast until Sunday evening at 6 P.M.\n\n(TS: 10 Sep 17:02 ET)​​​‍​​‌‍​​‌‍​​​​​​‌‍​​‌‍​​​​​​​​​‌‍​​​‌‍​‌‍​​‌‍​​​​​​​​​​‌‍​​​‌‍​​​​​​​‌‍​​​​​​​‌‍",
    "date": "2025-09-10T21:15:35.000Z"
  },
  {
    "id": "Brazil is doing a terrible thing on their treatment of former President Jair Bolsonaro. I have watch",
    "text": "Brazil is doing a terrible thing on their treatment of former President Jair Bolsonaro. I have watched, as has the World, as they have done nothing but come after him, day after day, night after night, month after month, year after year! He is not guilty of anything, except",
    "date": "2025-07-07T15:04:23.000Z"
  },
  {
    "id": "The ANIMAL who so violently killed the beautiful young lady from Ukraine, who came to America search",
    "text": "The ANIMAL who so violently killed the beautiful young lady from Ukraine, who came to America searching for peace and safety, should be given a “Quick” (there is no doubt!) Trial, and only awarded THE DEATH PENALTY. There can be no other option!!! PRESIDENT DONALD J. TRUMP\n\n(TS:",
    "date": "2025-09-10T12:53:53.000Z"
  }
]